In [33]:
import pandas as pd

employer_df = pd.read_csv('CadastroFuncionarios.csv', sep=';', decimal=',')
client_df = pd.read_csv('CadastroClientes.csv', sep=';', decimal=',')
service_df = pd.read_excel('BaseServiçosPrestados.xlsx', decimal=',')

client_df.head()

   ID Cliente             Cliente  Valor Contrato Mensal
0           1  Teixeira Gonçalves                    540
1           2        Souza Santos                   1260
2           3        Emídio Alves                   3195
3           4        Santos Costa                   2520
4           5         Do Monteiro                   3510

In [34]:
service_df.head()

,Codigo do Servico,ID Funcionário,ID Cliente,Tempo Total de Contrato (Meses)
0,OS0001,67,1,14
1,OS0002,17,2,12
2,OS0003,116,4,14
3,OS0004,37,5,8
4,OS0005,130,6,8

### Questão 1
Valor total da folha salarial -> Qual foi o gasto total com salários de funcionários pela empresa?

In [35]:
employer_df['Salario Total'] = employer_df['Salario Base'] + employer_df['Impostos'] + employer_df['Beneficios'] + employer_df['VT'] + employer_df['VR']
salario_total = employer_df['Salario Total'].sum()
salario_total

2717493.22

### Questão 2
Qual foi o faturamento total da empresa?

In [36]:
revenue_df = service_df.merge(client_df, on='ID Cliente')
revenue_df.head()

,Codigo do Servico,ID Funcionário,ID Cliente,Tempo Total de Contrato (Meses),Cliente,Valor Contrato Mensal
0,OS0001,67,1,14,Teixeira Gonçalves,540
1,OS0002,17,2,12,Souza Santos,1260
2,OS0003,116,4,14,Santos Costa,2520
3,OS0004,37,5,8,Do Monteiro,3510
4,OS0005,130,6,8,Soares Lobo,2340

In [45]:
revenue_df['Valor total do Contrato'] = revenue_df['Tempo Total de Contrato (Meses)'] * revenue_df['Valor Contrato Mensal']
print('O total captado pela empresa foi: R${:,}'.format(revenue_df['Valor total do Contrato'].sum()))

O total captado pela empresa foi: R$5,519,160